#/usr/bin/env pyton
# -*- coding: utf-8 -*-
'''
#
#
# python cookbook 第六章 面向对象编程
# Writer：张广欣
# Date：2014-06-12
#
#
'''
"""
6.1　温标的转换 223
6.2　定义常量 225
6.3　限制属性的设置 227
6.4　链式字典查询 229
6.5　继承的替代方案-自动托管 231
6.6　在代理中托管特殊方法 234
6.7　有命名子项的元组 237
6.8　避免属性读写的冗余代码 239
6.9　快速复制对象 240
6.10　保留对被绑定方法的引用且支持垃圾回收 243
6.11　缓存环的实现 245
6.12　检查一个实例的状态变化 249
6.13　检查一个对象是否包含某种必要的属性 252
6.14　实现状态设计模式 255
6.15　实现单例模式 257
6.16　用Borg惯用法来避免"单例"模式 259
6.17　Null对象设计模式的实现 263
6.18　用_ _init_ _参数自动初始化实例变量 266
6.19　调用超类的_ _init_ _方法 267
6.20　精确和安全地使用协作的超类调用 270
"""